H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    int16_t total_rows = ((int16_t)chaps + 4) / 5;
    drawScrollBar(total_rows, vis_rows, menu_scroll);
    drawNavBar("Marks", "Settings", "Bright");
}

// ─────────────────────────────────────────────────────────────────────────────
// Reading view — draws the paged verse text
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::drawReadingLines() {
    int16_t  sub_px = (int16_t)fmodf(scroll_px, (float)lineH());
    int16_t  first  = (int16_t)(scroll_px / (float)lineH());
    uint8_t  vis    = visLines() + 1;   // +1 covers partial bottom row
    int16_t  cy     = (int16_t)contentY();
    int16_t  ce     = cy + (int16_t)contentH();
    uint16_t lh     = lineH();

    read_line = first;

    // Allocate one line-height sprite for atomic pushes — eliminates both the
    // per-line ripple (interleaved fill+draw) and the full-zone flash (single
    // big clear).  Each pushSprite() is a single SPI burst; the TFT viewport
    // clips any partial line at the header/nav boundaries.
    if (!line_spr.createSprite(scrW(), lh)) {
        // Allocation failed (very low heap) — fall back to direct draw.
        tft.startWrite();
        tft.fillRect(0, cy, scrW(), contentH(), bg());
        tft.endWrite();
        return;
    }

    tft.setViewport(0, cy, scrW(), contentH(), false);

    // Track current verse number for highlight support.
    // Scan backward from 'first' to find which verse that line belongs to.
    uint8_t cur_verse_num = 0;
    for (int16_t k = first; k >= 0; k--) {
        if (lines[k][0] == '^') {
            const char* pipe = strchr(lines[k] + 1, '|');
            if (pipe) { cur_verse_num = (uint8_t)atoi(lines[k] + 1); break; }
        }
    }
    // Highlight background — accent colour from Settings
    uint16_t hi_bg = sel_bg();

    // Precompute bookmark verse-range for this chapter (first matching verse bookmark).
    // Bookmark verse ranges are highlighted the same as search/selection highlights.
    uint8_t bm_v1 = 0, bm_v2 = 0;
    for (uint8_t k = 0; k < bm_count; k++) {
        if (bookmarks[k].book == cur_book && bookmarks[k].chapter == cur_chapter
                && bookmarks[k].verse_first > 0) {
            bm_v1 = bookmarks[k].verse_first;
            bm_v2 = bookmarks[k].verse_last;
            break;  // show first matching range only
        }
    }

    for (uint8_t i = 0; i < vis; i++) {
        int16_t row_y    = cy - sub_px + (int16_t)i * (int16_t)lh;
        if (row_y >= ce) break;

        int16_t line_idx = first + (int16_t)i;

        // Update verse tracking before drawing
        if (line_idx >= 0 && line_idx < (int16_t)line_count) {
            const char* ln = lines[line_idx];
            if (ln[0] == '^') {
                const char* pipe = strchr(ln + 1, '|');
                if (pipe) cur_verse_num = (uint8_t)atoi(ln + 1);
            }
        }

        uint16_t line_bg = bg();
        if (highlight_verse > 0 && cur_verse_num == highlight_verse)
            line_bg = hi_bg;
        else if (sel_verse_first > 0
                 && cur_verse_num >= sel_verse_first
                 && cur_verse_num <= sel_verse_last)
            line_bg = hi_bg;
        else if (bm_v1 > 0
                 && cur_verse_num >= bm_v1
                 && cur_verse_num <= bm_v2)
            line_bg = hi_bg;

        line_spr.fillSprite(line_bg);

        if (line_idx >= 0 && line_idx < (int16_t)line_count) {
            const char* ln = lines[line_idx];
            if (ln[0] == '^') {
                const char* pipe = strchr(ln + 1, '|');
                if (pipe) {
                    char num_str[12];
                    int  n_len = (int)(pipe - (ln + 1));
                    if (n_len > 6) n_len = 6;
                    memcpy(num_str, ln + 1, n_len);
                    num_str[n_len]     = '.';
                    num_str[n_len + 1] = 0;
                    line_spr.setTextColor(verse_num_fg(), line_bg);
                    int16_t nx = line_spr.drawString(num_str, 4, 2, font_num);
                    line_spr.setTextColor(font_fg(), line_bg);
                    drawStringUTF8(line_spr, pipe + 1, 4 + nx + 2, 2, font_num, font_fg());
                }
            } else {
                line_spr.setTextColor(font_fg(), line_bg);
                drawStringUTF8(line_spr, ln, 4, 2, font_num, font_fg());
            }
        }

        // pushSprite respects the viewport set above, clipping partial lines
        line_spr.pushSprite(0, row_y);
    }

    tft.resetViewport();
    line_spr.deleteSprite();
}

void BibleInterface::drawReading() {
    tft.fillScreen(bg());
    char hdr[48];
    // Single-chapter books (Songs) show just the title — no redundant " 1".
    if (bookChapters(cur_book) <= 1)
        snprintf(hdr, sizeof(hdr), "%s", bookDisplay(cur_book));
    else
        snprintf(hdr, sizeof(hdr), "%s %d", bookDisplay(cur_book), cur_chapter);
    drawHeader(hdr);
    drawReadingLines();
    drawNavBar("Marks", "Settings", "+Mark");
}

// ─────────────────────────────────────────────────────────────────────────────
// Settings screen
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::redrawSettingsContent() {
#ifdef HAS_CAP_TOUCH
    const uint8_t  n = 7;
#else
    const uint8_t  n = 8;
#endif
    const int16_t  btn_w = 28, btn_h = 22, btn_r = 4;

    for (uint8_t i = 0; i < n; i++) {
        int16_t row_y = contentY() + (int16_t)i * itemH();
        bool    sel   = (i == (int16_t)menu_sel);

        if (i == 1 || i == 5) {
            // Font Color (1) or Highlight (5): label + [<] Name [>] controls.
            const char* lbl   = (i == 1) ? "Font Color" : "Highlight";
            const char* cname = (i == 1) ? FONT_COLOR_NAMES[font_color_idx]
                                         : ACCENT_NAMES[accent_idx];
            drawListRow(row_y, lbl, sel, false);

            uint16_t bg_c  = sel ? sel_bg() : bg();
            int16_t  btn_y = row_y + (itemH() - btn_h) / 2;
            int16_t  txt_y = btn_y + (btn_h - 16) / 2;
            int16_t  nam_y = row_y + (itemH() - 16) / 2;

            int16_t fwd_bx = (int16_t)scrW() - 4 - btn_w;
            tft.fillRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, hdr_bg());
            tft.drawRoundRect(fwd_bx, btn_y, btn_w, btn_h, btn_r, dim_fg());
            tft.setTextColor(TFT_WHITE, hdr_bg());
            tft.drawCentreString(">", fwd_bx + btn_w / 2, txt_y, 2);

            int16_t nam_w = (int16_t)tft.textWidth(cname, 2);
            int16_t nam_x = fwd_bx - 4 - nam_w;
            tft.setTextColor(fg(), bg_c);
            tft.drawString(cname, nam_x, nam_y, 2);

