H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = (float)menu_scroll * (float)tile_h;

        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            if      (tx > scrW() - scrW()/3) { blCycle(); needs_redraw = true; }
            else if (tx < scrW()/3)           { goToBookmarks(); }
            else                               { goToSettings(); }
            return;
        }
        // Highlight the touched chapter tile immediately for press feedback
        if (ty >= (uint16_t)contentY() && ty < (uint16_t)(scrH() - navH())) {
            uint8_t col_p = (uint8_t)(tx / tile_w);
            uint8_t row_p = (uint8_t)((ty - contentY()) / tile_h);
            uint16_t ch_p  = (uint16_t)((menu_scroll + row_p) * 5 + col_p + 1);
            if (ch_p >= 1 && ch_p <= chaps) {
                menu_sel = (int16_t)ch_p;
                redrawChapterContent();
            }
        }
        return;
    }

    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 12) {
            scroll_dragging = true;
            menu_sel = -1;  // clear tile highlight when drag begins
        }
        if (scroll_dragging) {
            // Chapter grid stays quantized during drag
            float raw_px   = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            float max_px   = (float)max_scroll * (float)tile_h;
            if (raw_px < 0.f) raw_px = 0.f;
            if (raw_px > max_px) raw_px = max_px;
            scroll_px = raw_px;
            int16_t new_scroll = (int16_t)(scroll_px / (float)tile_h);
            recordVel((int16_t)ty, millis());
            if (new_scroll != menu_scroll) {
                menu_scroll = new_scroll;
                redrawChapterContent();
            }
        }
        return;
    }

    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // Navigate to the chapter highlighted on press
        if (menu_sel < 1 || menu_sel > (int16_t)chaps) return;
        goToReading((int16_t)menu_sel);
    }
}

void BibleInterface::handleReadingInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);

    // ── Finger just touched ────────────────────────────────────────────────
    if (down && !touch_was_down) {
        touch_was_down  = true;
        touch_down_x    = tx;
        touch_down_y    = ty;
        scroll_dragging = false;
        stopFling();
        drag_origin_px  = scroll_px;
        if (touchInHeader(tx, ty)) {
            touch_was_down = false;
            if (touchInSearchIcon(tx, ty)) { goToSearchInput(); return; }
            if (tx < 48) goBack();
            return;
        }
        if (touchInNav(tx, ty)) {
            touch_was_down = false;
            uint16_t third = scrW() / 3;
            if (tx < third)      { goToBookmarks();      return; }
            if (tx < 2 * third)  { goToSettings();       return; }
            addBookmarkCurrent(); return;
        }
        return;
    }

    // ── Finger held down — pixel-accurate drag ────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) scroll_dragging = true;
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)line_count - (int)visLines()) * (float)lineH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px = new_px;
            recordVel((int16_t)ty, millis());
            drawReadingLines();  // updates read_line internally from scroll_px
        }
        return;
    }

    // ── Finger lifted ─────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }
        // Tap without drag ─────────────────────────────────────────────────
        // If tap is in the verse-number column (x < 55) and in the content
        // area, toggle verse selection instead of doing page navigation.
        if ((int16_t)touch_down_x < 55
                && (int16_t)touch_down_y >= (int16_t)contentY()
                && (int16_t)touch_down_y < (int16_t)(contentY() + contentH())) {
            // Determine which line was tapped
            int16_t sub_px   = (int16_t)fmodf(scroll_px, (float)lineH());
            int16_t first_ln = (int16_t)(scroll_px / (float)lineH());
            int16_t row_off  = ((int16_t)touch_down_y - (int16_t)contentY() + sub_px) / (int16_t)lineH();
            int16_t line_idx = first_ln + row_off;

            // Scan backward from tapped line to find the owning verse number
            uint8_t v = 0;
            for (int16_t k = line_idx; k >= 0; k--) {
                if (k < (int16_t)line_count && lines[k][0] == '^') {
                    const char* pipe = strchr(lines[k] + 1, '|');
                    if (pipe) { v = (uint8_t)atoi(lines[k] + 1); break; }
                }
            }

