H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
    // ── Finger held — pixel-accurate drag ────────────────────────────────────
    if (down && touch_was_down) {
        int16_t dy = (int16_t)ty - (int16_t)touch_down_y;
        if (!scroll_dragging && abs(dy) > 8) {
            scroll_dragging = true;
            bm_sel = -1;  // clear press highlight when drag begins
        }
        if (scroll_dragging) {
            float max_px = (float)max(0, (int)bm_count - (int)visItems()) * (float)itemH();
            float new_px = drag_origin_px + (float)((int16_t)touch_down_y - (int16_t)ty);
            if (new_px < 0.f) new_px = 0.f;
            if (new_px > max_px) new_px = max_px;
            scroll_px = new_px;
            bm_scroll = (int16_t)(scroll_px / (float)itemH());
            recordVel((int16_t)ty, millis());
            redrawListContent(bm_count);
        }
        return;
    }

    // ── Finger lifted ────────────────────────────────────────────────────────
    if (!down && touch_was_down) {
        touch_was_down = false;
        if (scroll_dragging) {
            scroll_dragging = false;
            float v = computeFlingVel();
            if (fabsf(v) > 50.f) {
                fling_vel    = v < -4000.f ? -4000.f : v > 4000.f ? 4000.f : v;
                fling_active = true;
                fling_ms     = millis();
            } else {
                stopFling();
            }
            return;
        }

        // Tap selects the bookmark; navigation is via the "View" button.
        // Nothing else to do on lift — selection was set on press.
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Navigation helpers
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::goToTransSelect() {
    stopFling();
    view     = BV_TRANS_SELECT;
    menu_sel = (int16_t)cur_trans;
    // Scroll to show selected translation
    menu_scroll = 0;
    if (cur_trans >= visItems()) {
        int16_t mid   = (int16_t)cur_trans - (int16_t)(visItems() / 2);
        int16_t max_s = (int16_t)trans_count - (int16_t)visItems();
        menu_scroll   = (mid > max_s) ? max_s : mid;
        if (menu_scroll < 0) menu_scroll = 0;
    }
    scroll_px    = (float)menu_scroll * (float)itemH();
    needs_redraw = true;
}
void BibleInterface::goToSection() {
    stopFling();
    // Modes with a single section (e.g. Dictionary) skip the section list.
    if (numSecs() <= 1) { goToBook(0); return; }
    view = BV_SECTION_SELECT;
    // Scroll the current section into view (Songs can have many categories).
    menu_sel    = (int16_t)cur_sec;
    menu_scroll = 0;
    if (cur_sec >= visItems()) {
        int16_t mid   = (int16_t)cur_sec - (int16_t)(visItems() / 2);
        int16_t max_s = (int16_t)numSecs() - (int16_t)visItems();
        menu_scroll   = (mid > max_s) ? max_s : mid;
        if (menu_scroll < 0) menu_scroll = 0;
    }
    scroll_px   = (float)menu_scroll * (float)itemH();
    needs_redraw = true;
}
void BibleInterface::goToBook(uint8_t sec) {
    stopFling();
    cur_sec = sec;
    view    = BV_BOOK_SELECT;
    // Scroll to show cur_book within this section
    uint16_t local_idx = 0;
    if (sec == bookSection(cur_book)) {
        local_idx = cur_book - secStart(sec);
    }
    menu_sel    = (int16_t)local_idx;
    uint16_t cnt = secLen(sec);
    menu_scroll = 0;
    if (local_idx >= visItems()) {
        int16_t mid = (int16_t)local_idx - (int16_t)(visItems() / 2);
        int16_t max_s = (int16_t)cnt - (int16_t)visItems();
        menu_scroll = (mid > max_s) ? max_s : mid;
        if (menu_scroll < 0) menu_scroll = 0;
    }
    scroll_px = (float)menu_scroll * (float)itemH();
    needs_redraw = true;
}
void BibleInterface::goToChapter(uint16_t book) {
    stopFling();
    cur_book = book;
    // Single-chapter books (each Song is one chapter) skip the chapter grid and
    // open the reader directly.
    if (bookChapters(book) <= 1) { goToReading(1); return; }
    view     = BV_CHAPTER_SELECT;
    // Scroll grid to show cur_chapter
    const uint16_t tile_h   = 36;
    uint8_t        vis_rows = (uint8_t)(contentH() / tile_h);
    int16_t        row      = (int16_t)((cur_chapter - 1) / 5);
    int16_t        total_rows = ((int16_t)bookChapters(book) + 4) / 5;
    int16_t        max_s    = total_rows - (int16_t)vis_rows;
    if (max_s < 0) max_s = 0;
    menu_scroll = row - (int16_t)(vis_rows / 2);
    if (menu_scroll > max_s)  menu_scroll = max_s;
    if (menu_scroll < 0)      menu_scroll = 0;
    menu_sel  = (int16_t)cur_chapter;   // 1-based; used for tile highlight
    scroll_px = (float)menu_scroll * (float)tile_h;
    needs_redraw = true;
}
void BibleInterface::drawLoading() {
    tft.fillScreen(bg());
    char hdr[48];
    snprintf(hdr, sizeof(hdr), "%s %d", bookDisplay(cur_book), cur_chapter);
    drawHeader(hdr);
    tft.setTextColor(dim_fg(), bg());
    tft.drawCentreString("Loading...", scrW() / 2, contentY() + contentH() / 2 - 8, 2);
    drawMemUsage((int16_t)(contentY() + contentH() / 2 + 16));
}

void BibleInterface::goToReading(uint16_t chapter, int16_t start_line) {
    stopFling();
    sel_verse_first = sel_verse_last = 0;  // clear verse selection on chapter change
    cur_chapter = chapter;
    read_line   = start_line;
    scroll_px   = (float)start_line * (float)lineH();
    drawLoading();
    view        = BV_READING;
    cacheChapter(cur_book, cur_chapter);
    buildWrappedLines();
    saveState();
    needs_redraw = true;
}
void BibleInterface::goToSettings() {
    stopFling();
    view = BV_SETTINGS;
    menu_sel = 0;
    needs_redraw = true;
}
void BibleInterface::goToBookmarks() {
    stopFling();
    bm_confirm_pending = false;
    view = BV_BOOKMARKS;
    bm_sel = 0; bm_scroll = 0;
    scroll_px = 0.f;
    needs_redraw = true;
}
// ─────────────────────────────────────────────────────────────────────────────
// Mode-parameterized SD paths and NVS namespace
// ─────────────────────────────────────────────────────────────────────────────
const char* BibleInterface::basePath() const {
    switch (mode) {
        case MODE_SONGS: return SONGS_SD_BASE;
        case MODE_DICT:  return DICT_SD_BASE;
        default:         return BIBLE_SD_BASE;
    }
}
const char* BibleInterface::nvsNamespace() const {
    switch (mode) {
        case MODE_SONGS: return "songs";
        case MODE_DICT:  return "dict";
        default:         return "bible";
    }
}
void BibleInterface::bmPath(char* out, size_t n) const {
    snprintf(out, n, "%s/bookmarks.txt", basePath());
}
void BibleInterface::srchHistPath(char* out, size_t n) const {
    snprintf(out, n, "%s/srch_hist.txt", basePath());
}

// ─────────────────────────────────────────────────────────────────────────────
// Runtime structure tables (Songs / Dictionary) — allocated from PSRAM if present
// ─────────────────────────────────────────────────────────────────────────────
// Allocate from PSRAM when available, but ALWAYS fall back to internal SRAM if
// PSRAM is absent or not enabled in the build — these tables are small (a few KB,
// up to ~50 KB for the largest songbook) and must never fail just because PSRAM
// isn't there. A NULL here used to crash Bible reads and bounce Songs/Dict to the menu.
static inline void* rt_alloc(size_t sz) {
#ifdef HAS_PSRAM
    void* p = ps_malloc(sz);
    if (p) return p;
#endif
    return malloc(sz);
}
#define RT_MALLOC(sz) rt_alloc(sz)

// Map the first character of a dictionary query to its letter-bucket book code
// (must match generate_dict_xml.py: a-z -> "A".."Z", digit -> "NUM", else "SYM";
// German umlauts fold to their base letter, matching the generator's bucketing).
static void dictBucketCode(char first, char* out) {
    unsigned char c = (unsigned char)first;
    char base = 0;
    if      (c >= 'A' && c <= 'Z') base = (char)(c - 'A' + 'a');
    else if (c >= 'a' && c <= 'z') base = (char)c;
    else if (c == 0x80 || c == 0x81) base = 'a';   // Ä ä
    else if (c == 0x82 || c == 0x83) base = 'o';   // Ö ö
    else if (c == 0x84 || c == 0x85) base = 'u';   // Ü ü
    else if (c == 0x86)              base = 's';    // ß
    if (base >= 'a' && base <= 'z') { out[0] = (char)(base - 'a' + 'A'); out[1] = 0; return; }
    if (c >= '0' && c <= '9') { strcpy(out, "NUM"); return; }
    strcpy(out, "SYM");
}

// Last loadToc() failure reason (shown on screen by selectTranslation).
static const char* g_toc_err = "";

void BibleInterface::freeRuntime() {
    if (rt_books)     { free(rt_books);     rt_books     = nullptr; }
    if (rt_secs)      { free(rt_secs);      rt_secs      = nullptr; }
    if (book_offsets) { free(book_offsets); book_offsets = nullptr; }
    rt_book_count = 0; rt_sec_count = 0; book_offsets_cap = 0;
}

