H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
// Load <base>/<stem>.toc into rt_books[], rt_secs[] and book_offsets[].
//   S|<section display name>
//   B|<code>|<display>|<chapterCount>|<sectionIndex>|<byteOffset>
// Books must be grouped by section and contiguous (the generator guarantees this).
bool BibleInterface::loadToc(const char* stem) {
    freeRuntime();
    char path[80];
    snprintf(path, sizeof(path), "%s/%s.toc", basePath(), stem);

    // Open ONCE and read the whole file into a buffer, then parse from memory.
    // (Avoids reopening the same SD file twice, which is unreliable on some builds.)
    g_toc_err = "";
    File f = SD.open(path);
    if (!f) { g_toc_err = "file not found"; Serial.printf("[%s] TOC missing: %s\n", nvsNamespace(), path); return false; }
    if (f.isDirectory()) { f.close(); g_toc_err = "is a directory"; return false; }
    size_t sz = f.size();
    if (sz == 0) { f.close(); g_toc_err = "file is empty"; Serial.printf("[%s] TOC empty: %s\n", nvsNamespace(), path); return false; }
    char* buf = (char*)RT_MALLOC(sz + 1);
    if (!buf) { f.close(); g_toc_err = "low memory (enable PSRAM)"; Serial.println(F("[toc] buf alloc fail")); return false; }
    size_t got = f.read((uint8_t*)buf, sz);
    f.close();
    buf[got] = 0;

    // Pass 1: count S| and B| lines.
    uint16_t nsec = 0, nbook = 0;
    for (char* ln = buf; *ln; ) {
        char* nl = strchr(ln, '\n');
        size_t len = nl ? (size_t)(nl - ln) : strlen(ln);
        if (len >= 2 && ln[1] == '|') {
            if      (ln[0] == 'S') nsec++;
            else if (ln[0] == 'B') nbook++;
        }
        if (!nl) break;
        ln = nl + 1;
    }
    if (nbook == 0) { free(buf); g_toc_err = "no B| rows (bad TOC)"; return false; }

    rt_secs      = (RtSec*)   RT_MALLOC(sizeof(RtSec)   * (nsec ? nsec : 1));
    rt_books     = (RtBook*)  RT_MALLOC(sizeof(RtBook)  * nbook);
    book_offsets = (uint32_t*)RT_MALLOC(sizeof(uint32_t)* nbook);
    if (!rt_secs || !rt_books || !book_offsets) { free(buf); freeRuntime(); g_toc_err = "low memory (enable PSRAM)"; return false; }
    book_offsets_cap = nbook;

    // Pass 2: fill (parse each line in place; field separator is '|').
    uint16_t si = 0, bi = 0;
    for (char* ln = buf; *ln; ) {
        char* nl = strchr(ln, '\n');
        if (nl) *nl = 0;                          // terminate this line
        // strip a trailing '\r' (in case the file has CRLF endings)
        size_t len = strlen(ln);
        while (len && (ln[len - 1] == '\r' || ln[len - 1] == ' ')) ln[--len] = 0;

        if (len >= 2 && ln[1] == '|') {
            if (ln[0] == 'S' && si < nsec) {
                strncpy(rt_secs[si].name, ln + 2, RT_SEC_NAME_LEN - 1);
                rt_secs[si].name[RT_SEC_NAME_LEN - 1] = 0;
                utf8Encode(rt_secs[si].name);   // UTF-8 umlauts → private codes for rendering
                rt_secs[si].start = 0; rt_secs[si].len = 0;
                si++;
            } else if (ln[0] == 'B' && bi < nbook) {
                // B|<code>|<display>|<chapters>|<sectionIndex>|<byteOffset>
                char* f1 = strchr(ln + 2, '|');
                char* f2 = f1 ? strchr(f1 + 1, '|') : nullptr;
                char* f3 = f2 ? strchr(f2 + 1, '|') : nullptr;
                char* f4 = f3 ? strchr(f3 + 1, '|') : nullptr;
                if (f1 && f2 && f3 && f4) {
                    *f1 = *f2 = *f3 = *f4 = 0;       // split into fields
                    strncpy(rt_books[bi].code, ln + 2, RT_CODE_LEN - 1);
                    rt_books[bi].code[RT_CODE_LEN - 1] = 0;
                    strncpy(rt_books[bi].display, f1 + 1, RT_DISP_LEN - 1);
                    rt_books[bi].display[RT_DISP_LEN - 1] = 0;
                    utf8Encode(rt_books[bi].display);  // UTF-8 umlauts → private codes
                    uint16_t chaps = (uint16_t)atoi(f2 + 1);
                    rt_books[bi].chapters = chaps ? chaps : 1;
                    rt_books[bi].section  = (uint16_t)atoi(f3 + 1);
                    book_offsets[bi]      = (uint32_t)strtoul(f4 + 1, nullptr, 10);
                    bi++;
                }
            }
        }
        if (!nl) break;
        ln = nl + 1;
    }
    free(buf);
    rt_book_count = bi;
    rt_sec_count  = si;

    // Derive section start/len from the (contiguous, section-grouped) book list.
    for (uint16_t s = 0; s < rt_sec_count; s++) { rt_secs[s].start = 0; rt_secs[s].len = 0; }
    for (uint16_t b = 0; b < rt_book_count; b++) {
        uint16_t s = rt_books[b].section;
        if (s >= rt_sec_count) continue;
        if (rt_secs[s].len == 0) rt_secs[s].start = b;
        rt_secs[s].len++;
    }
    book_idx_valid = true;   // offsets came from the TOC; no .idx scan needed
    book_idx_trans = cur_trans;
    Serial.printf("[%s] TOC %s: %u sections, %u books\n",
                  nvsNamespace(), stem, rt_sec_count, rt_book_count);
    return true;
}

// ─────────────────────────────────────────────────────────────────────────────
// Main menu (root) — pick Bible / Songs / Dictionary
// ─────────────────────────────────────────────────────────────────────────────
static const char* const MENU_LABELS[3] = { "Bible", "Songs", "Dictionary" };

void BibleInterface::goToMainMenu() {
    stopFling();
    // Restore the menu's own appearance/namespace (board-global brightness lives here).
    prefs.end();
    prefs.begin("menu", false);
    mode       = MODE_BIBLE;            // accessors unused at the menu
    dark_mode  = prefs.getBool ("dark",   true);
    accent_idx = prefs.getUChar("accent", 0);
    if (accent_idx >= ACCENT_COUNT) accent_idx = 0;
    font_num   = 2;
    // Keep the current backlight level (avoids a brightness flash when returning
    // from a mode); each mode still applies its own brightness on entry.
    freeRuntime();
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;
    view = BV_MAIN_MENU;
    menu_sel = 0; menu_scroll = 0; scroll_px = 0.f;
    needs_redraw = true;
}

void BibleInterface::drawMainMenu() {
    tft.fillScreen(bg());
    drawHeader("ESP-32 Library", false);

    // Each button is shaded with that mode's own saved highlight (accent) colour,
    // read from its NVS namespace. The dark/light variant matches the menu's theme
    // so the accents contrast with the menu background.
    static const char* const MODE_NS[3] = { "bible", "songs", "dict" };
    uint16_t btn_col[3];
    for (uint8_t i = 0; i < 3; i++) {
        Preferences mp;
        uint8_t ac = 0;
        if (mp.begin(MODE_NS[i], true)) {       // read-only
            ac = mp.getUChar("accent", 0);
            mp.end();
        }
        if (ac >= ACCENT_COUNT) ac = 0;
        btn_col[i] = dark_mode ? ACCENT_DARK[ac] : ACCENT_LIGHT[ac];
    }

    const int16_t margin = 16;
    const int16_t gap    = 14;
    int16_t top   = (int16_t)contentY() + 12;
    int16_t avail = (int16_t)scrH() - top - 12;
    int16_t bh    = (avail - gap * 2) / 3;
    for (uint8_t i = 0; i < 3; i++) {
        int16_t y = top + i * (bh + gap);
        tft.fillRoundRect(margin, y, scrW() - 2 * margin, bh, 12, btn_col[i]);
        tft.drawRoundRect(margin, y, scrW() - 2 * margin, bh, 12, dim_fg());
        tft.setTextColor(fg(), btn_col[i]);
        tft.drawCentreString(MENU_LABELS[i], scrW() / 2, y + (bh - 26) / 2, 4);
    }
}

void BibleInterface::handleMainMenuInput() {
    uint16_t tx, ty;
    bool down = pollTouch(&tx, &ty);
    if (down && !touch_was_down) {
        touch_was_down = true;
        touch_down_x = tx; touch_down_y = ty;
        return;
    }
    if (!down && touch_was_down) {
        touch_was_down = false;
        const int16_t margin = 16;
        const int16_t gap    = 14;
        int16_t top   = (int16_t)contentY() + 12;
        int16_t avail = (int16_t)scrH() - top - 12;
        int16_t bh    = (avail - gap * 2) / 3;
        for (uint8_t i = 0; i < 3; i++) {
            int16_t y = top + i * (bh + gap);
            if ((int16_t)touch_down_y >= y && (int16_t)touch_down_y < y + bh &&
                (int16_t)touch_down_x >= margin && (int16_t)touch_down_x < (int16_t)scrW() - margin) {
                enterMode((ContentMode)i);
                return;
            }
        }
        // Tap elsewhere (e.g. dismissing a "no files" message) — repaint the menu.
        needs_redraw = true;
    }
}

// ─────────────────────────────────────────────────────────────────────────────
// Mode switching
// ─────────────────────────────────────────────────────────────────────────────
void BibleInterface::enterMode(ContentMode m) {
    prefs.end();
    mode = m;
    freeRuntime();
    cached_book = 0xFFFF; cached_chap = 0; cached_count = 0;
    book_idx_valid = false;

    prefs.begin(nvsNamespace(), false);
    loadState();                          // per-mode font/dark/accent/position/search
    blSet(prefs.getUChar("bright", 19));  // per-mode brightness (no re-attach)
    loadBookmarks();
    loadSearchHistory();
    scanTranslations();

    if (trans_count == 0) {
        tft.fillScreen(bg());
        drawHeader("ESP-32 Library", false);
        tft.setTextColor(TFT_RED, bg());
        char msg[48];
        snprintf(msg, sizeof(msg), "No %s files on SD", MENU_LABELS[m]);
        tft.drawCentreString(msg, scrW() / 2, scrH() / 2 - 18, 2);
        char where[48];
        snprintf(where, sizeof(where), "Copy .xml to %s/", basePath());
        tft.setTextColor(dim_fg(), bg());
        tft.drawCentreString(where, scrW() / 2, scrH() / 2 + 6, 2);
        tft.drawCentreString("Tap to go back", scrW() / 2, scrH() / 2 + 30, 2);
        // Stay on the menu state so a tap returns; do not auto-redraw over the message.
        mode = MODE_BIBLE;
        view = BV_MAIN_MENU;
        needs_redraw = false;
        return;
    }
    if (cur_trans >= trans_count) cur_trans = 0;

    // Multiple translations → show the picker; otherwise open the single one.
    if (trans_count > 1) {
        if (mode != MODE_BIBLE) loadToc(trans_stems[cur_trans]);  // so cur_book clamps correctly
        goToTransSelect();
    } else {
        selectTranslation(cur_trans);
    }
}

