H4W9/ESP32_Bible/bible_firmware/BibleInterface.cpp
        // Songs/Dict lines start with a "T<trans>" token; strip and remember it.
        uint8_t bm_trans = 0;
        if (line[0] == 'T' && line.length() > 1 && isdigit((unsigned char)line[1])) {
            int sp = line.indexOf(' ');
            if (sp < 0) continue;
            bm_trans = (uint8_t)line.substring(1, sp).toInt();
            line = line.substring(sp + 1);
            line.trim();
        }

        int s1 = line.indexOf(' ');
        int s2 = (s1 >= 0) ? line.indexOf(' ', s1 + 1) : -1;
        if (s1 < 0 || s2 < 0) continue;
        uint16_t book = (uint16_t)line.substring(0, s1).toInt();
        uint16_t chap = (uint16_t)line.substring(s1 + 1, s2).toInt();
        if (chap == 0) continue;

        // Detect format: new has two more integer tokens before the label.
        // Check tokens 3 and 4 — if both are all-digit, it is new format.
        // This handles book names starting with a digit (1Ki, 2Co, 1John, etc.)
        // because those names contain letters and will fail the all-digit check.
        int s3 = line.indexOf(' ', s2 + 1);
        int s4 = (s3 >= 0) ? line.indexOf(' ', s3 + 1) : -1;
        bool new_fmt = false;
        if (s3 > s2 + 1 && s4 > s3 + 1) {
            new_fmt = true;
            for (int k = s2 + 1; k < s3 && new_fmt; k++)
                if (!isdigit((unsigned char)line[k])) new_fmt = false;
            for (int k = s3 + 1; k < s4 && new_fmt; k++)
                if (!isdigit((unsigned char)line[k])) new_fmt = false;
        }

        uint8_t v1 = 0, v2 = 0;
        String  label;
        if (new_fmt) {
            v1    = (uint8_t)line.substring(s2 + 1, s3).toInt();
            v2    = (uint8_t)line.substring(s3 + 1, s4).toInt();
            label = line.substring(s4 + 1);
        } else {
            label = line.substring(s2 + 1);
        }

        bookmarks[bm_count].book        = book;
        bookmarks[bm_count].chapter     = chap;
        bookmarks[bm_count].verse_first = v1;
        bookmarks[bm_count].verse_last  = v2;
        bookmarks[bm_count].trans       = bm_trans;
        strncpy(bookmarks[bm_count].label, label.c_str(), BIBLE_BM_LABEL_LEN - 1);
        bookmarks[bm_count].label[BIBLE_BM_LABEL_LEN - 1] = 0;
        bm_count++;
    }
    f.close();
}

void BibleInterface::scanTranslations() {
    trans_count = 0;
    File root = SD.open(basePath());
    if (!root) {
        Serial.println(F("[Bible] /bible/ not found"));
        return;
    }
    while (trans_count < BIBLE_MAX_TRANS) {
        File entry = root.openNextFile();
        if (!entry) break;
        if (entry.isDirectory()) { entry.close(); continue; }
        String name = entry.name();
        entry.close();
        // Accept only .xml files
        name.toLowerCase();
        if (!name.endsWith(".xml")) continue;
        // Strip path prefix if present
        int slash = name.lastIndexOf('/');
        if (slash >= 0) name = name.substring(slash + 1);
        // Remove .xml extension to get the stem
        String stem = name.substring(0, name.length() - 4);
        stem.toUpperCase();  // display as "ASV", "WEB", etc.
        strncpy(trans_stems[trans_count], stem.c_str(), BIBLE_TRANS_LEN - 1);
        trans_stems[trans_count][BIBLE_TRANS_LEN - 1] = 0;
        trans_count++;
        Serial.printf("[Bible] Found translation: %s\n", trans_stems[trans_count - 1]);
    }
    root.close();
    // Restore lowercase stems (paths need lowercase for SD.open)
    for (uint8_t i = 0; i < trans_count; i++) {
        String s = trans_stems[i];
        s.toLowerCase();
        strncpy(trans_stems[i], s.c_str(), BIBLE_TRANS_LEN - 1);
        trans_stems[i][BIBLE_TRANS_LEN - 1] = 0;
    }
    // Sort the list alphabetically so the picker (songbooks/dictionaries/Bibles)
    // is in a predictable order.
    for (uint8_t i = 0; i + 1 < trans_count; i++)
        for (uint8_t j = i + 1; j < trans_count; j++)
            if (strcmp(trans_stems[j], trans_stems[i]) < 0) {
                char tmp[BIBLE_TRANS_LEN];
                strncpy(tmp, trans_stems[i], BIBLE_TRANS_LEN);
                strncpy(trans_stems[i], trans_stems[j], BIBLE_TRANS_LEN);
                strncpy(trans_stems[j], tmp, BIBLE_TRANS_LEN);
            }
    if (cur_trans >= trans_count) cur_trans = 0;
}

// ─────────────────────────────────────────────────────────────────────────────
// Book byte-offset index
//
// Index file: /bible/<stem>.idx  (binary, 316 bytes)
//   uint32_t magic     = 0x42494458  ('B','I','D','X')
//   uint32_t version   = 1
//   uint32_t xml_size               (size of the .xml — detects replacement)
//   uint32_t offsets[BIBLE_BOOK_COUNT]  (byte offset of each book's first verse)
//
// offset == 0 means "not found in this translation" → fall back to full scan.
// ─────────────────────────────────────────────────────────────────────────────

bool BibleInterface::loadBookIndex(const char* stem) {
    char idx_path[64];
    snprintf(idx_path, sizeof(idx_path), "%s/%s.idx", basePath(), stem);
    File fi = SD.open(idx_path);
    if (!fi) return false;

    // Validate file size: header(12) + offsets(76*4) = 316 bytes
    const uint32_t expected = 12 + (uint32_t)BIBLE_BOOK_COUNT * sizeof(uint32_t);
    if ((uint32_t)fi.size() != expected) { fi.close(); return false; }

    uint32_t magic, ver, xml_size;
    fi.read((uint8_t*)&magic,    4);
    fi.read((uint8_t*)&ver,      4);
    fi.read((uint8_t*)&xml_size, 4);
    if (magic != 0x42494458UL || ver != 1) { fi.close(); return false; }

    // Compare stored XML size against the actual file — detects replaced translations
    char xml_path[64];
    snprintf(xml_path, sizeof(xml_path), "%s/%s.xml", basePath(), stem);
    File fx = SD.open(xml_path);
    if (!fx) { fi.close(); return false; }
    uint32_t actual_xml = (uint32_t)fx.size();
    fx.close();
    if (actual_xml != xml_size) { fi.close(); return false; }

    fi.read((uint8_t*)book_offsets, BIBLE_BOOK_COUNT * sizeof(uint32_t));
    fi.close();
    Serial.printf("[Bible] Loaded index: %s\n", idx_path);
    return true;
}

// Scan the XML file and record the byte offset of the first <verse> tag for
// each book.  Displays a "Building index..." screen while working.
bool BibleInterface::buildBookIndex(const char* stem) {
    char path[64];
    snprintf(path, sizeof(path), "%s/%s.xml", basePath(), stem);
    File f = SD.open(path);
    if (!f) return false;

